app/views/poems/_form.html.slim

SELECT "tags"."name" FROM "tags" INNER JOIN "poems_tags" ON "tags"."id" = "poems_tags"."tag_id" WHERE "poems_tags"."poem_id" = $1  [["poem_id", 2]]
---
    .col-lg-10
      = text_field_tag 'tags', @poem.tags.pluck(:name).join(', '), :class => 'form-control', disabled: :disabled, data: {tags_field: ''}