app/views/poems/index.html.slim

        td
          - if current_user.present? && current_user == poem.user
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]