app/views/poems/show.html.slim

SELECT "tags".* FROM "tags" INNER JOIN "poems_tags" ON "tags"."id" = "poems_tags"."tag_id" WHERE "poems_tags"."poem_id" = $1  [["poem_id", 1]]
---
      td
        - @poem.tags.each do |tag|

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
'
- if current_user.present? && current_user == @poem.user