app/views/profiles/show.html.slim

  =< link_to poems_path + "?profile_id=#{@profile.id}" do
    = pluralize @profile.user.poems.count, 'poem'
---
SELECT COUNT(*) FROM "poems" WHERE "poems"."user_id" = $1  [["user_id", 1]]

  =< link_to short_stories_path + "?profile_id=#{@profile.id}" do
    = pluralize@profile.user.short_stories.count, 'story'
---
SELECT COUNT(*) FROM "short_stories" WHERE "short_stories"."user_id" = $1  [["user_id", 1]]