app/views/short_stories/show.html.slim

      td
        - @short_story.tags.each do |tag|
---
SELECT "tags".* FROM "tags" INNER JOIN "short_stories_tags" ON "tags"."id" = "short_stories_tags"."tag_id" WHERE "short_stories_tags"."short_story_id" = $1  [["short_story_id", 1]]

'
- if current_user.present? && current_user == @short_story.user
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]