app/controllers/homes_controller.rb

  def index
    if params[:tag_name].present?
      @poems = Tag.find_by_name(params[:tag_name]).poems
      @short_stories = Tag.find_by_name(params[:tag_name]).short_stories
    else
      @poems = Poem.page(1)
---
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT 1  [["name", "love"]]
SELECT "poems".* FROM "poems" INNER JOIN "poems_tags" ON "poems"."id" = "poems_tags"."poem_id" WHERE "poems_tags"."tag_id" = $1  [["tag_id", 1]]
SELECT "tags".* FROM "tags"