app/controllers/poems_controller.rb

  def index
    if params[:profile_id].present?
      @poems = Profile.find(params[:profile_id]).user.poems.page(params[:page])
    else
      @poems = current_user.present? ? current_user.poems.page(params[:page]) : Poem.all.page(params[:page])
---
SELECT  "poems".* FROM "poems" WHERE "poems"."user_id" = $1 LIMIT 25 OFFSET 0  [["user_id", 1]]
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT 1  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "poems" WHERE "poems"."user_id" = $1  [["user_id", 1]]
SELECT  "poems".* FROM "poems" LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "poems"

  def create
    @poem = Poem.new(poem_params)
    @poem.user = current_user

    if params[:tags_id].present?
      arr = params[:tags_id].split(',')
      @poem.tags = Tag.find(arr)
    end

    respond_to do |format|
      if @poem.save
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "poems" ("title", "content", "metaphor", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test"], ["content", "love netherlangs"], ["metaphor", "test"], ["user_id", 1], ["created_at", "2016-06-08 16:07:54.158582"], ["updated_at", "2016-06-08 16:07:54.158582"]]

  def destroy
    @poem.destroy
---
DELETE FROM "poems" WHERE "poems"."id" = $1  [["id", 1]]

    def set_poem
      @poem = Poem.find(params[:id])
---
SELECT  "poems".* FROM "poems" WHERE "poems"."id" = $1 LIMIT 1  [["id", 2]]