app/controllers/profiles_controller.rb

  def update
    respond_to do |format|
      if @profile.update(user_params)
---
UPDATE "profiles" SET "name" = $1, "biography" = $2 WHERE "profiles"."id" = $3  [["name", "test"], ["biography", "test"], ["id", 1]]