app/controllers/short_stories_controller.rb

  def index
    if params[:profile_id].present?
      @short_stories = Profile.find(params[:profile_id]).user.short_stories.page(params[:page])
    else
      @short_stories = current_user.present? ? current_user.short_stories.page(params[:page]) : ShortStory.all.page(params[:page])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT 1  [["user_id", 1]]
SELECT  "short_stories".* FROM "short_stories" WHERE "short_stories"."user_id" = $1 LIMIT 25 OFFSET 0  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "short_stories" WHERE "short_stories"."user_id" = $1  [["user_id", 1]]
SELECT  "short_stories".* FROM "short_stories" LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "short_stories"

  def create
    @short_story = ShortStory.new(short_story_params)
    @short_story.user = current_user

    if params[:tags_id].present?
      arr = params[:tags_id].split(',')
      @short_story.tags = Tag.find(arr)
    end

    respond_to do |format|
      if @short_story.save
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "short_stories" ("title", "content", "short_description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test"], ["content", "test love"], ["short_description", "test"], ["user_id", 1], ["created_at", "2016-06-08 16:37:15.450864"], ["updated_at", "2016-06-08 16:37:15.450864"]]

    def set_short_story
      @short_story = ShortStory.find(params[:id])
---
SELECT  "short_stories".* FROM "short_stories" WHERE "short_stories"."id" = $1 LIMIT 1  [["id", 1]]